In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

Read data from [this link](https://www.kaggle.com/bananuhbeatdown/multiple-ml-techniques-and-analysis-of-dataset/data)

In [2]:
df = pd.read_csv('data/adult.csv' )
df.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [3]:
df.shape

(32561, 15)

In [4]:
df.replace('?', np.nan, inplace=True)
df.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,NaN,77053,HS-grad,9,Widowed,NaN,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,NaN,186061,Some-college,10,Widowed,NaN,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [5]:
df.isna().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In this case, we'll just drop the rows that contain `nan` values.

In [6]:
df.dropna(inplace=True)
df.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

Saving the edited dataframe

Target variable is the `income` column. Let's see the distribution of the target variable:

In [7]:
df['income'].value_counts()

<=50K    22654
>50K      7508
Name: income, dtype: int64

=> There's about a 1:3 ratio among the two classes.

Replacing the target variable with `1` and `0` values:

In [8]:
df['income'] = df['income'].apply(lambda x: 0 if x=='<=50K' else 1)
df['income'].value_counts()

0    22654
1     7508
Name: income, dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30162 entries, 1 to 32560
Data columns (total 15 columns):
age               30162 non-null int64
workclass         30162 non-null object
fnlwgt            30162 non-null int64
education         30162 non-null object
education.num     30162 non-null int64
marital.status    30162 non-null object
occupation        30162 non-null object
relationship      30162 non-null object
race              30162 non-null object
sex               30162 non-null object
capital.gain      30162 non-null int64
capital.loss      30162 non-null int64
hours.per.week    30162 non-null int64
native.country    30162 non-null object
income            30162 non-null int64
dtypes: int64(7), object(8)
memory usage: 3.7+ MB

In [10]:
df.shape

(30162, 15)

Identifying the categorical columns

In [11]:
cats = ['workclass', 'education', 'marital.status', 'occupation', 'relationship', 'race', 'sex', 'native.country']

In [12]:
# appending the name _cat for categorical variables
df_cats = df.loc[:,cats]
df_cats.columns = [x+'_cat' for x in cats]
df_cats.head()

,workclass_cat,education_cat,marital.status_cat,occupation_cat,relationship_cat,race_cat,sex_cat,native.country_cat
1,Private,HS-grad,Widowed,Exec-managerial,Not-in-family,White,Female,United-States
3,Private,7th-8th,Divorced,Machine-op-inspct,Unmarried,White,Female,United-States
4,Private,Some-college,Separated,Prof-specialty,Own-child,White,Female,United-States
5,Private,HS-grad,Divorced,Other-service,Unmarried,White,Female,United-States
6,Private,10th,Separated,Adm-clerical,Unmarried,White,Male,United-States

In [13]:
[i for i in df_cats.columns]

['workclass_cat',
 'education_cat',
 'marital.status_cat',
 'occupation_cat',
 'relationship_cat',
 'race_cat',
 'sex_cat',
 'native.country_cat']

In [14]:
df_numeric = df.drop(cats, axis=1)
df_numeric.head()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week,income
1,82,132870,9,0,4356,18,0
3,54,140359,4,0,3900,40,0
4,41,264663,10,0,3900,40,0
5,34,216864,9,0,3770,45,0
6,38,150601,6,0,3770,40,0

In [15]:
df = pd.concat([df_cats, df_numeric], axis=1)

In [16]:
df.to_csv("data/adult_edited.csv",index=False)